tutorials/AMB2018-02-B-AMR/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication decomposePar
runParallel $application

runApplication reconstructPar

#------------------------------------------------------------------------------
